<?php
// проверка авторизации
require "auth.php";
if($_SESSION['user_login']!='operator'){die;}
function T1($date_add, $date_go_work){
	if($date_go_work == null){return '-';}
	$date_add = strtotime($date_add);
	$date = $date_go_work - $date_add;
	$date = SecondesToTime($date);
	return $date;
}
?>

<!DOCTYPE html "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
	<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
	<title>Информация для работы, обновлено 29.10.2013</title>
	<link rel="stylesheet" type="text/css" href="main.css" />
	<script type='text/javascript' src='http://code.jquery.com/jquery-latest.min.js'></script>
	<script type='text/javascript' src='jquery.tablesorter.min.js'></script>
	<script type='text/javascript' src='jquery.metadata.js'></script>
</head>

<body>

<div class="top_menu">
	<ul>
		<li><a href="task.php">Назад</a></li>
	</ul>
</div>
<div class="">
	<p>Статистика по времени:</p>
		<ul>
			<li> 1) если общее время заявки на ремонт или восстановление меньше заложенного срока (3 - 10 дней), то клиент останится доволен и менеджер с курьером получит премию (+7% от ЗП по итогам месяца)</li>
			<li> 2) если общее время заявки на ремонт или восстановление больше заложенного срока (3 - 10 дней), то клиент останится НЕДОВОЛЕН и менеджер с курьером получит штраф (-10% от ЗП по итогам месяца)</li>
			<li> 3) если общее время заявки на ремонт или восстановление составляет больше 20 дней и эта ситуация не 4.2, то клиент останится ОЧЕНЬ НЕДОВОЛЕН и менеджер с курьером получит штраф (-15% от ЗП по итогам месяца)</li>
			<br/>
			<li> 4) причины по которой срок ремонта или восстановления составляет больше 20 дней:</li>
			<br/>
				<ul>
					<li> 4.1) курьер и менеджер забивали на свою работу и общее время от создания заявки, до доставки диска в мастерскую, а также от доставки диска с мастерской, до передачи диска клиенту (статус "Выдан"), превышает 2-3 рабочих дня, за исключением случаев когда долго ехал</li>
					<li> 4.2) в прцессе диагностики/ремонта/восстановления информации выясняется что нет нужной детали (донора), необходимо связатся с клиентом, оговорить отсутствие детали, увеличение стоимости работ, увеличение сроков работ(максимум 7 дней к текущему), если мы укладываемся в оговореные сроки с учётом поиска, покупки и доставки детали (донора), то мы продолжаем работу? если детали нет, то дабы не портить статистику, репутацию закрываем заявку с пометкой об отсутствии нужной детали и отправляем диск обратно клиенту или утилизуруем. Ситауция данного типа может происходить в сроки до 20 дней </li>
				</ul>
			<br/>
			<li> 5) вышеописаное не означает что нужно отмораживаться от клиентов, если нет деталей т.е нужно тщательно искать детель (донора). Статистика показывает что если сразу не нашли, то вероятность что деталь найдётся в течении года минимальна и клиент который нахадится в режиме ожидания испытывает негативные эмоции</li>
			<li> 6) если мы деталь (донора) не нашли, вернули диск клиенту, после клиент нам перезвонил и сказал что в другом месте нам всё зделали, то менеджер получает штраф -5% от ЗП</li>
		</ul>
	<p>Соблюдение вышеописаных действий повысит скорость работы и репутацию.</p>
</div>
</body>
</html>