<?php
// проверка авторизации
require "auth.php";
if($_SESSION['user_login']=='operator' or $_SESSION['user_login']=='ghost'){
?>

<!DOCTYPE html "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
	<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
	<title>Акт выполненных работ</title>
	<script type='text/javascript' src='http://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js'></script>
	<link rel="stylesheet" type="text/css" href="main.css" />
</head>

<body style="margin-top:35px;width:800px">

	<?
	$res = mysql_query("SELECT * FROM task WHERE id=".mysql_real_escape_string($_GET['id']));
	$row = mysql_fetch_array($res);
	?>


	<table width="800" align="center">
	<tr>
	<td>
		<b>Сервис-центр «Нанобайт»</b><br>
		Крым, г. Симферополь, ул. Павленко, 15/72, оф. 11
		<h1>Тел.: 8 (978) 829 30 50</h1>
	</td>
	</tr>
	<tr>
	<td align="center">
		<h1 style="margin-top:25px;">Акт приёма №<?=$row['id']?>, <?=date('d.m.Y')?></h1>
	</td>
	</tr>	
	<td>
		<table width="800" align="center" border="1">
		<tr>
		<td style="background:#eee;">
		Модель, серийный номер
		</td>
		<td style="background:#eee;">
		Наименование работы
		</td>
		<td style="background:#eee;">
		<input type="text" value="Цена, руб." style="border:0;background:#eee;">
		</td>
		</tr>
		
		<tr>
		<td valign="top">
		<?=$row['model']?><br>
		<?=$row['sn']?>
		</td>
		<td width="500">
		<textarea style="border:none;font-family:Arial;width:100%;">Диагностика</textarea>
		</td>
		<td width="100">
		<textarea style="border:none;font-family:Arial;font-size:12pt;width:100%;">100</textarea>
		</td>
		</tr>
		
		</table>
	</td>
	</tr>
	
	<tr>
	<td style="padding-top:15px;">
	</td>
	</tr>	
	<tr>
	</table>
	
	<div  style="width:800px">
		<div>
		<div style="display:block;width:25px;"></div><b>1. Диагностика носителя информации (жесткий диск, флеш карта).</b>
		Стоимость диагностики носителя информации 100 рублей и оплачивается сразу. 
		В процессе диагностики определяется возможность, стоимость и сроки восстановления данных. Стоимость — согласно прайс-листа. Сроки восстановления данных определяются примерно, так как зависят от характера повреждений носителя информации.
		После проведения диагностики, ремонта или восстановления данных клиент будет извещен о результате. Сроки проведения диагностики в течение суток, в порядке общей очереди.
		</div>
		<div>
		<b>2. Процесс восстановления информации, результат.</b>
		Восстановление информации подразумевает что клиент приносит дефектный жесткий диск, флеш карту (далее «носитель информации»)  для восстановления информации с рабочей области носителя информации, при этом клиент осознает что информация, находящаяся в поврежденной области утеряна безвозвратно. В процессе восстановления информации носитель будет подключен к оборудованию, позволяющему восстанавливать данные с дефектного носителя информации с неповрежденных областей.  Количество и качество восстановленной информации зависит от степени повреждения носителя информации. Чем сильнее поврежден носитель информации, тем больше времени потребуется на восстановление.
		</div>
		<div>
		<b>3. Ремонт жесткого диска. </b>
		В процессе ремонта все данные, находящиеся на жестком диске полностью удаляются и размер жесткого диска может уменьшится.
		</div>
		<div>
		<b>4. Оплата за предоставленные услуги.</b>
		Конкретная стоимость восстановления данных озвучивается после диагностики носителя информации. Восстановленная информация не оплачивается в случае если: 
		все восстановленные папки пустые
		ни один файл не читается, не открывается
		Объем восстановленной информации не влияет на указанную стоимость услуги по прайс-листу.  В случае срочного восстановления данных, стоимость услуги увеличивается вдвое.
		</div>
		<div>
		<b>5. Утилизация носителя информации.</b>
		После извещения клиента об окончании и результате проведенных работ, клиенту дается 30 календарных дней для того, чтобы забрать свой носитель информации. В противном случае он будет утилизирован.
		</div>
		<div>С вышеописанными утверждениями согласен, претензий не имею</div>
		<br>
		<div style="font-size:15pt;">		<span style="font-size:15pt;">Заказчик:</span> <input type="text" style="border:none;font-family:Arial;font-size:15pt;width:300px;" value="<?=$row['client_name']?>, <?=$row['client_phone']?>">  подпись клиента _______________</div>
	</div>
</body>
</html>
<?
}else{
	die;
}
?>